7767517
58 66
Input                    in0                      0 1 in0
Convolution              conv_9                   1 1 in0 1 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728
PReLU                    prelu_31                 1 1 1 2 0=64
Split                    splitncnn_0              1 2 2 3 4
BatchNorm                bn_0                     1 1 3 5 0=64 1=1.000000e-05
Convolution              conv_10                  1 1 5 6 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
PReLU                    prelu_32                 1 1 6 7 0=64
Convolution              conv_12                  1 1 7 8 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Convolution              conv_11                  1 1 4 9 0=64 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=4096
BinaryOp                 add_0                    2 1 8 9 10 0=0
Split                    splitncnn_1              1 2 10 11 12
BatchNorm                bn_1                     1 1 12 13 0=64 1=1.000000e-05
Convolution              conv_13                  1 1 13 14 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
PReLU                    prelu_33                 1 1 14 15 0=64
Convolution              conv_14                  1 1 15 16 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_1                    2 1 16 11 17 0=0
Split                    splitncnn_2              1 2 17 18 19
BatchNorm                bn_2                     1 1 18 20 0=64 1=1.000000e-05
Convolution              conv_15                  1 1 20 21 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
PReLU                    prelu_34                 1 1 21 22 0=128
Convolution              conv_17                  1 1 22 23 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Convolution              conv_16                  1 1 19 24 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=8192
BinaryOp                 add_2                    2 1 23 24 25 0=0
Split                    splitncnn_3              1 2 25 26 27
BatchNorm                bn_3                     1 1 27 28 0=128 1=1.000000e-05
Convolution              conv_18                  1 1 28 29 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_35                 1 1 29 30 0=128
Convolution              conv_19                  1 1 30 31 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_3                    2 1 31 26 32 0=0
Split                    splitncnn_4              1 2 32 33 34
BatchNorm                bn_4                     1 1 33 35 0=128 1=1.000000e-05
Convolution              conv_20                  1 1 35 36 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
PReLU                    prelu_36                 1 1 36 37 0=256
Convolution              conv_22                  1 1 37 38 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Convolution              conv_21                  1 1 34 39 0=256 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=32768
BinaryOp                 add_4                    2 1 38 39 40 0=0
Split                    splitncnn_5              1 2 40 41 42
BatchNorm                bn_5                     1 1 42 43 0=256 1=1.000000e-05
Convolution              conv_23                  1 1 43 44 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_37                 1 1 44 45 0=256
Convolution              conv_24                  1 1 45 46 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_5                    2 1 46 41 47 0=0
Split                    splitncnn_6              1 2 47 48 49
BatchNorm                bn_6                     1 1 48 50 0=256 1=1.000000e-05
Convolution              conv_25                  1 1 50 51 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
PReLU                    prelu_38                 1 1 51 52 0=512
Convolution              conv_27                  1 1 52 53 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Convolution              conv_26                  1 1 49 54 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_6                    2 1 53 54 55 0=0
Split                    splitncnn_7              1 2 55 56 57
BatchNorm                bn_7                     1 1 57 58 0=512 1=1.000000e-05
Convolution              conv_28                  1 1 58 59 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
PReLU                    prelu_39                 1 1 59 60 0=512
Convolution              conv_29                  1 1 60 61 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_7                    2 1 61 56 62 0=0
BatchNorm                bn_8                     1 1 62 63 0=512 1=1.000000e-05
Flatten                  flatten_40               1 1 63 64
InnerProduct             linear_30                1 1 64 out0 0=512 1=1 2=12845056
